taboadaa/ShuQi/nRF/Packages/.cache/Keil.LPC54000_DFP.2.2.0.pdsc
            // Disable Reset Vector Catch in DEMCR
            value = Read32(DEMCR_Addr);
            Write32(DEMCR_Addr, (value &amp; (~0x00000001)));

            //Clear BP0 and FPB
            Write32(0xE0002008, 0);      						        // Clear BP0
            Write32(0xE0002000, 0x00000002);  			        // Disable FPB
          </block>
        </sequence>

        <!-- DebugCodeMemRemap Sequence -->
        <sequence name="DebugCodeMemRemap">
          <block>
            Write32 (0x40000000, 2);                        // Setup remap: Interrupt vectors reside in flash
          </block>
        </sequence>

        <!-- TraceStart Sequence for Cortex-M4 -->
        <sequence name="TraceStart_CM4">
          <block>
            __var traceSWO = (__traceout &amp; 0x1) != 0;   // SWO Trace Selected?
          </block>

          <control if="traceSWO">
            <block>
              Sequence("EnableTraceSWO_CM4");               // Call SWO Trace Setup
            </block>
          </control>
        </sequence>

        <!-- EnableTraceSWO Sequence for Cortex-M4 -->
        <sequence name="EnableTraceSWO_CM4">
          <block>
            Write32 (0x40000220, 0x00002000);               // Enable IOCON peripheral clock
            Write32 (0x40000304, 0x00000000);               // Enable Trace clock divider
          </block>

          <control if="LPC541xx_SWO_Pin == 0">
            <block>
              Write32 (0x4000103C, 2);                      // Configure PIO0_15 IOCON for function 2
            </block>
          </control>

          <control if="LPC541xx_SWO_Pin == 1">
            <block>
              Write32 (0x40001084, 2);                      // Configure PIO1_1 IOCON for function 2
            </block>
          </control>

          <control if="LPC541xx_SWO_Pin == 2">
            <block>
              Write32 (0x40001028, 6);                      // Configure PIO0_10 IOCON for function 6
            </block>
          </control>

          <control if="LPC541xx_SWO_Pin == 3">
            <block>
              Write32 (0x40001020, 4);                      // Configure PIO0_8 IOCON for function 4
            </block>
          </control>
        </sequence>

      </sequences>

      <!-- ************************  Subfamily 'LPC54100'  **************************** -->
      <subFamily DsubFamily="LPC54100">
        <processor Pname="M4" Dcore="Cortex-M4"  DcoreVersion="r0p1" Dfpu="1" Dmpu="1" Dendian="Little-endian" Dclock="100000000"/>

        <book Pname="M4" name="Documents/DUI0553A_cortex_m4_dgug.pdf" title="Cortex-M4 Generic User Guide"/>
        <description>
The LPC54100 Series microcontrollers were designed from the ground up to deliver the industry's best power efficiency for always-on sensor-processing applications.
These highly efficient MCUs support ultra-low-power performance for sensor tasks such as listening, collection, and aggregation of sensor data as well as complex sensor processing tasks such as sensor fusion.

Crucial for always-on applications, LPC54100 Series MCUs require as little as 3 uA for continuous sensor listening.
A first for sensor applications, an asymmetric dual-core architecture enables scalable active power/performance:
Developers can use the 55 uA/MHz Cortex-M0+ core for sensor data collection, aggregation, and external communications, or the ARM Cortex-M4 core (100 uA/MHz) to execute math-intensive algorithms (i.e., motion sensor fusion) more quickly while saving power.
The LPC54100 Series also includes single-core (ARM Cortex-M4) options with similar sensor listening and Cortex-M4 power efficiencies.
        </description>

        <!--compile Pname="M4" define="CORE_M4"/> With compile it is only possible to set one define.
                                                  using environment is a hack to be able to set an additional define -->
        <environment Pname="M4" name="uv">
          <CMisc>-DCORE_M4</CMisc>
        </environment>
        <debugvars configfile="Debug/LPC541xx.dbgconf">
          // Debug Access Variables, can be modified by user via copies of DBGCONF files as created by uVision. Also see sub-family level.
          __var LPC541xx_SWO_Pin = 0;                    // Serial Wire Output pin: 0 = PIO0_15, 1 = PIO1_1
          __var Dbg_CR           = 0x00000000;           // DBG_CR
          __var sCPU_ImageEntry  = 0x00020000;           // Slave CPU Image Start Entry
        </debugvars>

        <!-- *************************  Device 'LPC54101J256BD64'  ***************************** -->
        <device Dname="LPC54101J256BD64">
          <compile header="LPCOpen/lpc5410x/chip_5410x/inc/chip.h" define="CHIP_LPC5410X"/>
          <debug svd="SVD/LPC5410x.svd"/>
          <memory id="IROM1"                                  start="0x00000000" size="0x00040000" startup="1" default="1"/>
          <memory id="IRAM1"                                  start="0x02000000" size="0x00010000" init   ="0" default="1"/>
          <memory id="IRAM2"                                  start="0x02010000" size="0x00008000" init   ="0" default="1"/>
          <algorithm Pname="M4" name="Flash/LPC5410x_256.FLM" start="0x00000000" size="0x00040000"             default="1"/>

          <book name="Documents/LPC5410X.pdf" title="LPC5410x Datasheet"/>
          <book name="Documents/UM10850.pdf"  title="LPC5410x User manual"/>

          <feature type="UART"          n="4"/>
          <feature type="I2C"           n="3"/>
          <feature type="SPI"           n="2"/>
          <feature type="ADC"           n="12"       m="12"/>
          <feature type="Timer"         n="5"        m="32"/>
          <feature type="PWM"           n="1"/>
          <feature type="Temp"          n="-40"      m="105"/>
          <feature type="VCC"           n="1.62"     m="3.60"/>
          <feature type="IOs"           n="50"/>
          <feature type="QFP"           n="64"        name="Low-Profile QFP Package"/>
        </device>

        <!-- *************************  Device 'LPC54101J256UK49'  ***************************** -->
        <device Dname="LPC54101J256UK49">
          <compile header="LPCOpen/lpc5410x/chip_5410x/inc/chip.h" define="CHIP_LPC5410X"/>
          <debug svd="SVD/LPC5410x.svd"/>
          <memory id="IROM1"                                  start="0x00000000" size="0x00040000" startup="1" default="1"/>
          <memory id="IRAM1"                                  start="0x02000000" size="0x00010000" init   ="0" default="1"/>
          <memory id="IRAM2"                                  start="0x02010000" size="0x00008000" init   ="0" default="1"/>
          <algorithm Pname="M4" name="Flash/LPC5410x_256.FLM" start="0x00000000" size="0x00040000"             default="1"/>

          <book name="Documents/LPC5410X.pdf" title="LPC5410x Datasheet"/>
          <book name="Documents/UM10850.pdf"  title="LPC5410x User manual"/>

