taboadaa/ShuQi/nRF/Packages/.cache/Keil.LPC54000_DFP.2.2.0.pdsc
          <sequences>
            <!-- Begin: ResetProcessor Sequence for Cortex-M4 -->
            <sequence name="ResetProcessor" Pname="M4">
              <block>
                Sequence("ResetProcessor_LPC5410x_M4");
              </block>
            </sequence>

            <!-- Begin: ResetProcessor Sequence for Cortex-M0-->
            <sequence name="ResetProcessor" Pname="M0plus">
              <block>
                Sequence("ResetProcessor_LPC5410x_M0");
              </block>
            </sequence>

            <!-- ResetCatchSet Sequence for Cortex-M4 -->
            <sequence name="ResetCatchSet" Pname="M4">
              <block>
                Sequence("ResetCatchSet_LPC5410x_M4");
              </block>
            </sequence>

            <!--ResetCatchSet Sequence for Cortex-M0-->
            <sequence name="ResetCatchSet" Pname="M0plus">
              <block>
                Sequence("ResetCatchSet_LPC5410x_M0");
              </block>
            </sequence>


            <!-- Override for Pre-Defined TraceStart Sequence -->
            <sequence name="TraceStart"  Pname="M4">
              <block>
                Sequence("TraceStart_CM4");
              </block>
            </sequence>


          </sequences>

        </device>

        <!-- *************************  Device 'LPC54102J512UK49'  ***************************** -->
        <device Dname="LPC54102J512UK49">
          <processor Pname="M0plus" Dcore="Cortex-M0+" DcoreVersion="r0p1" Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="100000000"/>
          <environment Pname="M0plus" name="uv">
            <CMisc>-DCORE_M0PLUS</CMisc>
          </environment>
          <compile header="LPCOpen/lpc5410x/chip_5410x/inc/chip.h" define="CHIP_LPC5410X"/>
          <debug svd="SVD/LPC5410x.svd"/>
          <memory id="IROM1"                                  start="0x00000000" size="0x00080000" startup="1" default="1"/>
          <memory id="IRAM1"                                  start="0x02000000" size="0x00010000" init   ="0" default="1"/>
          <memory id="IRAM2"                                  start="0x02010000" size="0x00008000" init   ="0" default="1"/>
          <algorithm Pname="M4" name="Flash/LPC5410x_512.FLM" start="0x00000000" size="0x00080000"             default="1"/>

          <book Pname="M0plus" name="Documents/DUI0662B_cortex_m0p_r0p1_dgug.pdf" title="Cortex-M0+ Generic User Guide"/>
          <book name="Documents/LPC5410X.pdf" title="LPC5410x Datasheet"/>
          <book name="Documents/UM10850.pdf"  title="LPC5410x User manual"/>

          <feature type="UART"          n="4"/>
          <feature type="I2C"           n="3"/>
          <feature type="SPI"           n="2"/>
          <feature type="ADC"           n="12"       m="12"/>
          <feature type="Timer"         n="5"        m="32"/>
          <feature type="PWM"           n="1"/>
          <feature type="Temp"          n="-40"      m="105"/>
          <feature type="VCC"           n="1.62"     m="3.60"/>
          <feature type="IOs"           n="39"/>
          <feature type="CSP"           n="49"         name="Wafer-Level Chip-Scale Package"/>

          <debug Pname="M4" __dp="0" __ap="0"/>             <!-- AP 0 for Cortex-M4  -->
          <debug Pname="M0plus" __dp="0" __ap="1"/>         <!-- AP 1 for Cortex-M0+ -->

          <sequences>
            <!-- Begin: ResetProcessor Sequence for Cortex-M4 -->
            <sequence name="ResetProcessor" Pname="M4">
              <block>
                Sequence("ResetProcessor_LPC5410x_M4");
              </block>
            </sequence>

            <!-- Begin: ResetProcessor Sequence for Cortex-M0-->
            <sequence name="ResetProcessor" Pname="M0plus">
              <block>
                Sequence("ResetProcessor_LPC5410x_M0");
              </block>
            </sequence>

            <!-- ResetCatchSet Sequence for Cortex-M4 -->
            <sequence name="ResetCatchSet" Pname="M4">
              <block>
                Sequence("ResetCatchSet_LPC5410x_M4");
              </block>
            </sequence>

            <!--ResetCatchSet Sequence for Cortex-M0-->
            <sequence name="ResetCatchSet" Pname="M0plus">
              <block>
                Sequence("ResetCatchSet_LPC5410x_M0");
              </block>
            </sequence>


            <!-- Override for Pre-Defined TraceStart Sequence -->
            <sequence name="TraceStart"  Pname="M4">
              <block>
                Sequence("TraceStart_CM4");
              </block>
            </sequence>


          </sequences>

        </device>

      </subFamily>

      <!-- ************************  Subfamily 'LPC54110'  **************************** -->
      <subFamily DsubFamily="LPC54110">
        <processor Pname="M4" Dcore="Cortex-M4"  DcoreVersion="r0p1" Dfpu="1" Dmpu="1" Dendian="Little-endian" Dclock="100000000"/>

        <book Pname="M4" name="Documents/DUI0553A_cortex_m4_dgug.pdf" title="Cortex-M4 Generic User Guide"/>
        <description>
The LPC54110 Series microcontrollers were designed from the ground up to deliver the industry's best power efficiency for always-on sensor-processing applications.
These highly efficient MCUs support ultra-low-power performance for sensor tasks such as listening, collection, and aggregation of sensor data as well as complex sensor processing tasks such as sensor fusion.

Crucial for always-on applications, LPC54100 Series MCUs require as little as 3 uA for continuous sensor listening.
A first for sensor applications, an asymmetric dual-core architecture enables scalable active power/performance:
Developers can use the 55 uA/MHz Cortex-M0+ core for sensor data collection, aggregation, and external communications, or the ARM Cortex-M4 core (100 uA/MHz) to execute math-intensive algorithms (i.e., motion sensor fusion) more quickly while saving power.
The LPC54110 Series also includes single-core (ARM Cortex-M4) options with similar sensor listening and Cortex-M4 power efficiencies.
        </description>

