taboadaa/ShuQi/nRF/Packages/.cache/Keil.LPC54000_DFP.2.2.0.pdsc
        <!-- *************************  Device 'LPC54S606J512ET180'  ***************************** -->
        <device Dname="LPC54S606J512ET180">
          <compile header="Device/Include/LPC54S606.h" define="LPC54S606"/>
          <debug svd="SVD/LPC54S606.svd"/>
          <memory id="IROM1"                                  start="0x00000000" size="0x00080000" startup="1" default="1"/>
          <memory id="IRAM1"                                  start="0x20000000" size="0x00028000" init   ="0" default="1"/>
          <memory id="IRAM2"                                  start="0x04000000" size="0x00008000" init   ="0" default="0"/>
          <algorithm Pname="M4" name="Flash/LPC5460x_512.FLM" start="0x00000000" size="0x00080000"             default="1"/>

          <feature type="BGA"           n="180"/>
        </device>

        <!-- *************************  Device 'LPC54S608J512BD208'  ***************************** -->
        <device Dname="LPC54S608J512BD208">
          <compile header="Device/Include/LPC54S608.h" define="LPC54S608"/>
          <debug svd="SVD/LPC54S608.svd"/>
          <memory id="IROM1"                                  start="0x00000000" size="0x00080000" startup="1" default="1"/>
          <memory id="IRAM1"                                  start="0x20000000" size="0x00028000" init   ="0" default="1"/>
          <memory id="IRAM2"                                  start="0x04000000" size="0x00008000" init   ="0" default="0"/>
          <algorithm Pname="M4" name="Flash/LPC5460x_512.FLM" start="0x00000000" size="0x00080000"             default="1"/>

          <feature type="QFP"           n="208"/>
        </device>

        <!-- *************************  Device 'LPC54S608J512ET180'  ***************************** -->
        <device Dname="LPC54S608J512ET180">
          <compile header="Device/Include/LPC54S608.h" define="LPC54S608"/>
          <debug svd="SVD/LPC54S608.svd"/>
          <memory id="IROM1"                                  start="0x00000000" size="0x00080000" startup="1" default="1"/>
          <memory id="IRAM1"                                  start="0x20000000" size="0x00028000" init   ="0" default="1"/>
          <memory id="IRAM2"                                  start="0x04000000" size="0x00008000" init   ="0" default="0"/>
          <algorithm Pname="M4" name="Flash/LPC5460x_512.FLM" start="0x00000000" size="0x00080000"             default="1"/>

          <feature type="BGA"           n="180"/>
        </device>

        <!-- *************************  Device 'LPC54S616J512BD208'  ***************************** -->
        <device Dname="LPC54S616J512BD208">
          <compile header="Device/Include/LPC54S616.h" define="LPC54S616"/>
          <debug svd="SVD/LPC54S616.svd"/>
          <memory id="IROM1"                                  start="0x00000000" size="0x00080000" startup="1" default="1"/>
          <memory id="IRAM1"                                  start="0x20000000" size="0x00028000" init   ="0" default="1"/>
          <memory id="IRAM2"                                  start="0x04000000" size="0x00008000" init   ="0" default="0"/>
          <algorithm Pname="M4" name="Flash/LPC5460x_512.FLM" start="0x00000000" size="0x00080000"             default="1"/>

          <feature type="QFP"           n="208"/>
        </device>

        <!-- *************************  Device 'LPC54S616J512ET180'  ***************************** -->
        <device Dname="LPC54S616J512ET180">
          <compile header="Device/Include/LPC54S616.h" define="LPC54S616"/>
          <debug svd="SVD/LPC54S616.svd"/>
          <memory id="IROM1"                                  start="0x00000000" size="0x00080000" startup="1" default="1"/>
          <memory id="IRAM1"                                  start="0x20000000" size="0x00028000" init   ="0" default="1"/>
          <memory id="IRAM2"                                  start="0x04000000" size="0x00008000" init   ="0" default="0"/>
          <algorithm Pname="M4" name="Flash/LPC5460x_512.FLM" start="0x00000000" size="0x00080000"             default="1"/>

          <feature type="BGA"           n="180"/>
        </device>

        <!-- *************************  Device 'LPC54S618J512BD208'  ***************************** -->
        <device Dname="LPC54S618J512BD208">
          <compile header="Device/Include/LPC54S618.h" define="LPC54S618"/>
          <debug svd="SVD/LPC54S618.svd"/>
          <memory id="IROM1"                                  start="0x00000000" size="0x00080000" startup="1" default="1"/>
          <memory id="IRAM1"                                  start="0x20000000" size="0x00028000" init   ="0" default="1"/>
          <memory id="IRAM2"                                  start="0x04000000" size="0x00008000" init   ="0" default="0"/>
          <algorithm Pname="M4" name="Flash/LPC5460x_512.FLM" start="0x00000000" size="0x00080000"             default="1"/>

          <feature type="QFP"           n="208"/>
        </device>

        <!-- *************************  Device 'LPC54S618J512ET180'  ***************************** -->
        <device Dname="LPC54S618J512ET180">
          <compile header="Device/Include/LPC54S618.h" define="LPC54S618"/>
          <debug svd="SVD/LPC54S618.svd"/>
          <memory id="IROM1"                                  start="0x00000000" size="0x00080000" startup="1" default="1"/>
          <memory id="IRAM1"                                  start="0x20000000" size="0x00028000" init   ="0" default="1"/>
          <memory id="IRAM2"                                  start="0x04000000" size="0x00008000" init   ="0" default="0"/>
          <algorithm Pname="M4" name="Flash/LPC5460x_512.FLM" start="0x00000000" size="0x00080000"             default="1"/>

          <feature type="BGA"           n="180"/>
        </device>

      </subFamily>

    </family>
  </devices>

  <conditions>
    <!-- Compiler Conditions -->
    <condition id="Compiler ARMCC">
      <require Tcompiler="ARMCC"/>
    </condition>

    <!-- Device Conditions -->
    <condition id="LPC5410x">
      <description>NXP LPC5410x Devices</description>
      <require Dvendor="NXP:11" Dname="LPC5410*"/>
    </condition>

    <condition id="LPC5411x">
      <description>NXP LPC5411x Devices</description>
      <require Dvendor="NXP:11" Dname="LPC5411*"/>
    </condition>

