taboadaa/ShuQi/nRF/Packages/.cache/Keil.LPC54000_DFP.2.2.0.pdsc
    <condition id="LPC5460x">
      <description>NXP LPC5460x Devices</description>
      <accept Dvendor="NXP:11" Dname="LPC5460*"/>
    </condition>

    <condition id="LPC541xx">
      <description>NXP LPC541xx Devices</description>
      <require Dvendor="NXP:11" Dname="LPC541*"/>
    </condition>

    <!-- Device + Core Conditions -->
    <condition id="LPC5410x CM4">
      <description>NXP LPC5410x CM4 Devices</description>
      <require condition="LPC5410x"/>
      <require Dcore="Cortex-M4"/>
    </condition>
    <condition id="LPC5410x CM0+">
      <description>NXP LPC5410x CM0+ Devices</description>
      <require condition="LPC5410x"/>
      <require Dcore="Cortex-M0+"/>
    </condition>

    <condition id="LPC5411x CM4">
      <description>NXP LPC5411x CM4 Devices</description>
      <require condition="LPC5411x"/>
      <require Dcore="Cortex-M4"/>
    </condition>
    <condition id="LPC5411x CM0+">
      <description>NXP LPC5411x CM0+ Devices</description>
      <require condition="LPC5411x"/>
      <require Dcore="Cortex-M0+"/>
    </condition>

    <condition id="LPC5460x CM4">
      <description>NXP LPC5460x CM4 Devices</description>
      <require condition="LPC5460x"/>
      <require Dcore="Cortex-M4"/>
    </condition>
    <condition id="LPC5460x CM0+">
      <description>NXP LPC5460x CM0+ Devices</description>
      <require condition="LPC5460x"/>
      <require Dcore="Cortex-M0+"/>
    </condition>

    <!-- Device + Core + Compiler Conditions -->
    <condition id="LPC5410x CM4 ARMCC">
      <description>NXP LPC5410x CM4 Devices and the ARM compiler</description>
      <require condition="LPC5410x CM4"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="LPC5410x CM0+ ARMCC">
      <description>NXP LPC5410x CM0+ Devices and the ARM compiler</description>
      <require condition="LPC5410x CM0+"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="LPC5410x CM4 IAR">
      <description>NXP LPC5410x CM4 Devices and the IAR compiler</description>
      <require condition="LPC5410x CM4"/>
      <require Tcompiler="IAR"/>
    </condition>
    <condition id="LPC5410x CM0+ IAR">
      <description>NXP LPC5410x CM0+ Devices and the IAR compiler</description>
      <require condition="LPC5410x CM0+"/>
      <require Tcompiler="IAR"/>
    </condition>

    <condition id="LPC5411x CM4 ARMCC">
      <description>NXP LPC5411x CM4 Devices and the ARM compiler</description>
      <require condition="LPC5411x CM4"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="LPC5411x CM0+ ARMCC">
      <description>NXP LPC5411x CM0+ Devices and the ARM compiler</description>
      <require condition="LPC5411x CM0+"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="LPC5411x CM4 IAR">
      <description>NXP LPC5411x CM4 Devices and the IAR compiler</description>
      <require condition="LPC5411x CM4"/>
      <require Tcompiler="IAR"/>
    </condition>
    <condition id="LPC5411x CM0+ IAR">
      <description>NXP LPC5411x CM0+ Devices and the IAR compiler</description>
      <require condition="LPC5411x CM0+"/>
      <require Tcompiler="IAR"/>
    </condition>

    <condition id="LPC5460x CM4 ARMCC">
      <description>NXP LPC5460x CM4 Devices and the ARM compiler</description>
      <require condition="LPC5460x CM4"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="LPC5460x CM0+ ARMCC">
      <description>NXP LPC5460x CM0+ Devices and the ARM compiler</description>
      <require condition="LPC5460x CM0+"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="LPC5460x CM4 IAR">
      <description>NXP LPC5460x CM4 Devices and the IAR compiler</description>
      <require condition="LPC5460x CM4"/>
      <require Tcompiler="IAR"/>
    </condition>
    <condition id="LPC5460x CM0+ IAR">
      <description>NXP LPC5460x CM0+ Devices and the IAR compiler</description>
      <require condition="LPC5460x CM0+"/>
      <require Tcompiler="IAR"/>
    </condition>

    <!-- Device + CMSIS Conditions -->
    <condition id="LPC541xx CMSIS">
      <description>NXP LPC541xx Devices and CMSIS-CORE</description>
      <require condition="LPC541xx"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

    <condition id="LPC5410x CMSIS">
      <description>NXP LPC5410x Devices and CMSIS-CORE</description>
      <require condition="LPC5410x"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

    <condition id="LPC5411x CMSIS">
      <description>NXP LPC5411x Devices and CMSIS-CORE</description>
      <require condition="LPC5411x"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

    <condition id="LPC5460x CMSIS">
      <description>NXP LPC5460x Devices and CMSIS-CORE</description>
      <require condition="LPC5460x"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

    <condition id="LPC54616 CMSIS">
      <description>NXP LPC54616 Devices and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="NXP:11"/>
      <accept  Dname="LPC54616*"/>
    </condition>

    <condition id="LPC54618 CMSIS">
      <description>NXP LPC54618 Devices and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="NXP:11"/>
      <accept  Dname="LPC54618*"/>
    </condition>

    <condition id="LPC54S606 CMSIS">
      <description>NXP LPC54S606 Devices and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="NXP:11"/>
      <accept  Dname="LPC54S606*"/>
    </condition>

    <condition id="LPC54S608 CMSIS">
      <description>NXP LPC54S608 Devices and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="NXP:11"/>
      <accept  Dname="LPC54S608*"/>
    </condition>

    <condition id="LPC54S616 CMSIS">
      <description>NXP LPC54S616 Devices and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="NXP:11"/>
      <accept  Dname="LPC54S616*"/>
    </condition>

    <condition id="LPC54S618 CMSIS">
      <description>NXP LPC54S618 Devices and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="NXP:11"/>
      <accept  Dname="LPC54S618*"/>
    </condition>

    <!-- Device + CMSIS + LPCOpen Conditions -->
    <condition id="LPC541xx CMSIS LPCOPEN">
      <description>NXP LPC541xx Devices and LPCOpen firmware</description>
      <require condition="LPC541xx"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Cclass="Device" Cgroup="LPCOpen"/>
    </condition>

    <condition id="LPC5410x CMSIS LPCOPEN">
      <description>NXP LPC5410x Devices and LPCOpen firmware</description>
      <require condition="LPC5410x"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Cclass="Device" Cgroup="LPCOpen"/>
    </condition>

    <condition id="LPC5411x CMSIS LPCOPEN">
      <description>NXP LPC5411x Devices and LPCOpen firmware</description>
      <require condition="LPC5411x"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Cclass="Device" Cgroup="LPCOpen"/>
    </condition>

    <condition id="LPC541xx CMSIS LPCOPEN_BSP">
      <description>NXP LPC541xx Devices and LPCOpen board support firmware</description>
      <require condition="LPC541xx"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Cclass="Device" Cgroup="LPCOpen"/>
      <deny Cclass="Compiler" Cgroup="I/O"/>
    </condition>

