taboadaa/ShuQi/nRF/Packages/.cache/Keil.LPC54000_DFP.2.2.0.pdsc
    <condition id="LPC5460x CMSIS LPCOPEN">
      <description>NXP LPC5460x Devices and LPCOpen firmware</description>
      <require condition="LPC5460x"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Cclass="Device" Cgroup="LPCOpen"/>
    </condition>

    <condition id="LPC5460x CMSIS LPCOPEN_BSP">
      <description>NXP LPC5460x Devices and LPCOpen board support firmware</description>
      <require condition="LPC5460x"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Cclass="Device" Cgroup="LPCOpen"/>
      <deny Cclass="Compiler" Cgroup="I/O"/>
    </condition>

    <!-- CMSIS Driver Conditions -->
    <condition id="LPC541xx CMSIS_Driver I2C">
      <description>Requirement for CMSIS I2C Driver</description>
      <require condition="LPC541xx CMSIS LPCOPEN"/>
    </condition>

    <condition id="LPC5410x CMSIS_Driver SPI">
      <description>Requirement for CMSIS SPI Driver</description>
      <require condition="LPC5410x CMSIS LPCOPEN"/>
    </condition>

    <condition id="LPC5411x CMSIS_Driver SPI">
      <description>Requirement for CMSIS SPI Driver</description>
      <require condition="LPC5411x CMSIS LPCOPEN"/>
    </condition>

    <condition id="LPC541xx CMSIS_Driver SAI">
      <description>Requirement for CMSIS SAI Driver</description>
      <require condition="LPC5411x CMSIS"/>
      <require Cclass="Device" Cgroup="LPCOpen"/>
    </condition>

    <condition id="LPC5410x CMSIS_Driver USART">
      <description>Requirement for CMSIS USART Driver</description>
      <require condition="LPC5410x CMSIS LPCOPEN"/>
    </condition>

    <condition id="LPC5411x CMSIS_Driver USART">
      <description>Requirement for CMSIS USART Driver</description>
      <require condition="LPC5411x CMSIS LPCOPEN"/>
    </condition>

    <condition id="LPC541xx CMSIS_Driver USB">
      <description>Requirement for CMSIS USB Driver</description>
      <require condition="LPC5411x CMSIS"/>
      <require Cclass="Device" Cgroup="LPCOpen"/>
    </condition>

    <!-- Device + CMSIS Driver -->
    <condition id="LPC541xx I2C">
      <description>Requirement for components using CMSIS I2C driver</description>
      <require condition="LPC541xx"/>
      <require Cclass="CMSIS Driver" Cgroup="I2C"/>
    </condition>

    <condition id="LPC541xx SPI">
      <description>Requirement for components using CMSIS SPI driver</description>
      <require condition="LPC541xx"/>
      <require Cclass="CMSIS Driver" Cgroup="SPI"/>
    </condition>

    <condition id="LPC541xx I2C SAI">
      <description>Requirement for components using CMSIS I2C and SAI drivers</description>
      <require condition="LPC541xx"/>
      <require Cclass="CMSIS Driver" Cgroup="I2C"/>
      <require Cclass="CMSIS Driver" Cgroup="SAI"/>
    </condition>

    <!-- Board support Conditions -->
    <condition id="MCB54110 Audio common Mic">
      <description>Requirement for MCB54110 Audio microphone </description>
      <require condition="LPC541xx"/>
      <require Cclass="Board Support" Cgroup="Audio" Csub="Microphone"/>
    </condition>
    <condition id="MCB54110 Audio common Codec">
      <description>Requirement for MCB54110 Audio Codec</description>
      <require condition="LPC541xx"/>
      <require Cclass="Board Support" Cgroup="Audio" Csub="Codec"/>
    </condition>
    <condition id="MCB54110 Audio common Codec Mic">
      <description>Requirement for MCB54110 Audio Codec and Microphone</description>
      <require condition="LPC541xx"/>
      <require Cclass="Board Support" Cgroup="Audio" Csub="Codec"/>
      <require Cclass="Board Support" Cgroup="Audio" Csub="Microphone"/>
    </condition>
    <condition id="MCB54110 Audio Codec">
      <description>Requirement for MCB54110 Audio Codec</description>
      <require condition="LPC541xx I2C SAI"/>
      <require Cclass="Board Support" Cgroup="Audio" Csub="Audio"/>
    </condition>
    <condition id="MCB54110 Audio Mic">
      <description>Requirement for MCB54110 Audio Microphone</description>
      <require condition="LPC541xx CMSIS LPCOPEN"/>
      <require Cclass="Board Support" Cgroup="Audio" Csub="Audio"/>
    </condition>
  </conditions>

  <components>
    <!-- Startup LPC54100 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="3.1.0" condition="LPC541xx CMSIS LPCOPEN">
      <description>System Startup for NXP LPC54100 Devices</description>
      <files>
        <file category="header"    name="RTE_Driver/Config_LPC5410x/RTE_Device.h"                        attr="config" version="1.0.0" condition="LPC5410x"/>
        <file category="header"    name="RTE_Driver/Config_LPC5411x/RTE_Device.h"                        attr="config" version="1.0.0" condition="LPC5411x"/>

        <file category="sourceC"   name="LPCOpen/lpc5410x/chip_5410x/startup/sysinit.c"                  attr="config" version="1.0.0" condition="LPC5410x"/>
        <file category="sourceC"   name="LPCOpen/lpc5411x/chip_5411x/startup/sysinit.c"                  attr="config" version="1.0.0" condition="LPC5411x"/>

        <file category="sourceAsm" name="LPCOpen/lpc5410x/chip_5410x/startup/keil_startup_lpc5410x.s"    attr="config" version="1.0.0" condition="LPC5410x CM4 ARMCC"/>
        <file category="sourceAsm" name="LPCOpen/lpc5410x/chip_5410x/startup/keil_startup_lpc5410x-m0.s" attr="config" version="1.0.0" condition="LPC5410x CM0+ ARMCC"/>

        <file category="sourceAsm" name="LPCOpen/lpc5411x/chip_5411x/startup/keil_startup_lpc5411x.s"    attr="config" version="1.0.0" condition="LPC5411x CM4 ARMCC"/>
        <file category="sourceAsm" name="LPCOpen/lpc5411x/chip_5411x/startup/keil_startup_lpc5411x-m0.s" attr="config" version="1.0.0" condition="LPC5411x CM0+ ARMCC"/>

        <file category="sourceAsm" name="LPCOpen/lpc5410x/chip_5410x/startup/iar_startup_lpc5410x.s"     attr="config" version="1.0.0" condition="LPC5410x CM4 IAR"/>
        <file category="sourceAsm" name="LPCOpen/lpc5410x/chip_5410x/startup/iar_startup_lpc5410x-m0.s"  attr="config" version="1.0.0" condition="LPC5410x CM0+ IAR"/>

        <file category="sourceAsm" name="LPCOpen/lpc5411x/chip_5411x/startup/iar_startup_lpc5411x.s"     attr="config" version="1.0.0" condition="LPC5411x CM4 IAR"/>
        <file category="sourceAsm" name="LPCOpen/lpc5411x/chip_5411x/startup/iar_startup_lpc5411x-m0.s"  attr="config" version="1.0.0" condition="LPC5411x CM0+ IAR"/>
      </files>
    </component>

    <!-- Startup LPC54600 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="3.1.0" condition="LPC5460x CMSIS LPCOPEN">
      <description>System Startup for NXP LPC54600 Devices</description>
      <files>
        <file category="header"    name="RTE_Driver/Config_LPC5460x/RTE_Device.h"                        attr="config" version="1.0.0" condition="LPC5460x"/>

        <file category="sourceC"   name="LPCOpen/lpc5460x/chip_5460x/startup/sysinit.c"                  attr="config" version="1.0.0" condition="LPC5460x"/>

