taboadaa/ShuQi/nRF/Packages/.cache/Keil.LPC54000_DFP.2.2.0.pdsc
        <file category="sourceAsm" name="LPCOpen/lpc5460x/chip_5460x/startup/keil_startup_lpc5460x.s"    attr="config" version="1.0.0" condition="LPC5460x CM4 ARMCC"/>

        <file category="sourceAsm" name="LPCOpen/lpc5460x/chip_5460x/startup/iar_startup_lpc5460x.s"     attr="config" version="1.0.0" condition="LPC5460x CM4 IAR"/>
      </files>
    </component>

    <!-- Startup LPC54616 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="LPC54616 CMSIS">
      <description>System Startup for NXP LPC54616 Devices</description>
      <files>
        <file category="include" name="Device/Include/"/>
        <file category="source"  name="Device/Source/ARM/startup_LPC54616.s" attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/system_LPC54616.c"      attr="config" version="1.0.0"/>
        <file category="header"  name="Device/Source/system_LPC54616.h"      attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- Startup LPC54618 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="LPC54618 CMSIS">
      <description>System Startup for NXP LPC54618 Devices</description>
      <files>
        <file category="include" name="Device/Include/"/>
        <file category="source"  name="Device/Source/ARM/startup_LPC54618.s" attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/system_LPC54618.c"      attr="config" version="1.0.0"/>
        <file category="header"  name="Device/Source/system_LPC54618.h"      attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- Startup LPC54S606 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="LPC54S606 CMSIS">
      <description>System Startup for NXP LPC54S606 Devices</description>
      <files>
        <file category="include" name="Device/Include/"/>
        <file category="source"  name="Device/Source/ARM/startup_LPC54S606.s" attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/system_LPC54S606.c"      attr="config" version="1.0.0"/>
        <file category="header"  name="Device/Source/system_LPC54S606.h"      attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- Startup LPC54S608 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="LPC54S608 CMSIS">
      <description>System Startup for NXP LPC54S608 Devices</description>
      <files>
        <file category="include" name="Device/Include/"/>
        <file category="source"  name="Device/Source/ARM/startup_LPC54S608.s" attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/system_LPC54S608.c"      attr="config" version="1.0.0"/>
        <file category="header"  name="Device/Source/system_LPC54S608.h"      attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- Startup LPC54S616 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="LPC54S616 CMSIS">
      <description>System Startup for NXP LPC54S616 Devices</description>
      <files>
        <file category="include" name="Device/Include/"/>
        <file category="source"  name="Device/Source/ARM/startup_LPC54S616.s" attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/system_LPC54S616.c"      attr="config" version="1.0.0"/>
        <file category="header"  name="Device/Source/system_LPC54S616.h"      attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- Startup LPC54S618 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="LPC54S618 CMSIS">
      <description>System Startup for NXP LPC54S618 Devices</description>
      <files>
        <file category="include" name="Device/Include/"/>
        <file category="source"  name="Device/Source/ARM/startup_LPC54S618.s" attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/system_LPC54S618.c"      attr="config" version="1.0.0"/>
        <file category="header"  name="Device/Source/system_LPC54S618.h"      attr="config" version="1.0.0"/>
      </files>
    </component>


    <component Cclass="Device" Cgroup="LPCOpen" Cversion="3.01.000" condition="LPC5410x CMSIS">
      <description>LPCOpen chip drivers for the NXP LPC54100 family</description>
      <RTE_Components_h>
        #define RTE_DEVICE_LPCOPEN
      </RTE_Components_h>
      <files>
        <file category="library" condition="LPC5410x CM4 ARMCC"  name="LPCOpen/lpc5410x/chip_5410x/libs/keil_lib_power.lib"/>
        <file category="library" condition="LPC5410x CM4 ARMCC"  name="LPCOpen/lpc5410x/prj_lpcxpresso_54102/keil/lib_chip_5410x/keil_output/core_m4/lib_chip_5410x.lib" src="LPCOpen/lpc5410x/chip_5410x/src/"/>
        <file category="library" condition="LPC5410x CM0+ ARMCC" name="LPCOpen/lpc5410x/chip_5410x/libs/keil_lib_power_m0.lib"/>
        <file category="library" condition="LPC5410x CM0+ ARMCC" name="LPCOpen/lpc5410x/prj_lpcxpresso_54102/keil/lib_chip_5410x_m0/keil_output/core_m0/lib_chip_5410x_m0.lib" src="LPCOpen/lpc5410x/chip_5410x/src/"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="LPCOpen" Cversion="3.00c.001" condition="LPC5411x CMSIS">
      <description>LPCOpen chip drivers for the NXP LPC54110 family</description>
      <RTE_Components_h>
        #define RTE_DEVICE_LPCOPEN
      </RTE_Components_h>
      <files>
        <file category="library" condition="LPC5411x CM4 ARMCC"  name="LPCOpen/lpc5411x/chip_5411x/libs/keil_lib_power.lib"/>
        <file category="library" condition="LPC5411x CM4 ARMCC"  name="LPCOpen/lpc5411x/prj_xpresso54114/keil/lib_chip_5411x/keil_output/core_m4/lib_chip_5411x.lib" src="LPCOpen/lpc5411x/chip_5411x/src/"/>
        <file category="library" condition="LPC5411x CM0+ ARMCC" name="LPCOpen/lpc5411x/chip_5411x/libs/keil_lib_power_m0.lib"/>
        <file category="library" condition="LPC5411x CM0+ ARMCC" name="LPCOpen/lpc5411x/prj_xpresso54114/keil/lib_chip_5411x_m0/keil_output/core_m0/lib_chip_5411x_m0.lib" src="LPCOpen/lpc5411x/chip_5411x/src/"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="LPCOpen" Cversion="3.00.000" condition="LPC5460x CMSIS">
      <description>LPCOpen chip drivers for the NXP LPC54600 family</description>
      <RTE_Components_h>
        #define RTE_DEVICE_LPCOPEN
      </RTE_Components_h>
      <files>
        <file category="library" condition="LPC5460x CM4 ARMCC"  name="LPCOpen/lpc5460x/chip_5460x/libs/keil_lib_power.lib"/>
        <file category="library" condition="LPC5460x CM4 ARMCC"  name="LPCOpen/lpc5460x/prj_eval54607/keil/lib_chip_5460x/Objects/lib_chip_5460x.lib" src="LPCOpen/lpc5410x/chip_5410x/src/"/>
      </files>
    </component>

    <!-- CMSIS Driver class -->
    <component Cclass="CMSIS Driver" Cgroup="I2C" Capiversion="2.2" Cversion="1.0" condition="LPC541xx CMSIS_Driver I2C">
      <description>I2C Driver for LPC54100 Series</description>
      <RTE_Components_h>
        #define RTE_Drivers_I2C0                /* Driver I2C0 */
        #define RTE_Drivers_I2C1                /* Driver I2C1 */
        #define RTE_Drivers_I2C2                /* Driver I2C2 */
        #define RTE_Drivers_I2C3                /* Driver I2C3 */
        #define RTE_Drivers_I2C4                /* Driver I2C4 */
        #define RTE_Drivers_I2C5                /* Driver I2C5 */
        #define RTE_Drivers_I2C6                /* Driver I2C6 */
        #define RTE_Drivers_I2C7                /* Driver I2C7 */
      </RTE_Components_h>
      <files>
        <file category="source" name="RTE_Driver/I2C_LPC5410x.c" condition="LPC5410x"/>
        <file category="source" name="RTE_Driver/I2C_LPC5411x.c" condition="LPC5411x"/>
      </files>
    </component>

    <component Cclass="CMSIS Driver" Cgroup="SAI" Capiversion="1.0" Cversion="1.1" condition="LPC541xx CMSIS_Driver SAI">
      <description>SAI Driver for LPC54100 Series</description>
      <RTE_Components_h>
        #define RTE_Drivers_SAI0                /* Driver SAI0 */
        #define RTE_Drivers_SAI1                /* Driver SAI1 */
      </RTE_Components_h>
      <files>
        <file category="source" name="RTE_Driver/I2S_LPC5411x.c"/>
      </files>
    </component>

    <component Cclass="CMSIS Driver" Cgroup="SPI" Csub="SPI" Capiversion="2.1" Cversion="1.0" condition="LPC5410x CMSIS_Driver SPI">
      <description>SPI Driver for LPC54100 Series</description>
      <RTE_Components_h>
        #define RTE_Drivers_SPI0                /* Driver SPI0 */
        #define RTE_Drivers_SPI1                /* Driver SPI1 */
        #define RTE_Drivers_SPI2                /* Driver SPI2 */
        #define RTE_Drivers_SPI3                /* Driver SPI3 */
        #define RTE_Drivers_SPI4                /* Driver SPI4 */
        #define RTE_Drivers_SPI5                /* Driver SPI5 */
        #define RTE_Drivers_SPI6                /* Driver SPI6 */
        #define RTE_Drivers_SPI7                /* Driver SPI7 */
      </RTE_Components_h>
      <files>
        <file category="source" name="RTE_Driver/SPI_LPC5410x.c"/>
      </files>
    </component>

    <component Cclass="CMSIS Driver" Cgroup="SPI" Csub="SPI" Capiversion="2.1" Cversion="1.1" condition="LPC5411x CMSIS_Driver SPI">
      <description>SPI Driver for LPC54110 Series</description>
      <RTE_Components_h>
        #define RTE_Drivers_SPI0                /* Driver SPI0 */
        #define RTE_Drivers_SPI1                /* Driver SPI1 */
        #define RTE_Drivers_SPI2                /* Driver SPI2 */
        #define RTE_Drivers_SPI3                /* Driver SPI3 */
        #define RTE_Drivers_SPI4                /* Driver SPI4 */
        #define RTE_Drivers_SPI5                /* Driver SPI5 */
        #define RTE_Drivers_SPI6                /* Driver SPI6 */
        #define RTE_Drivers_SPI7                /* Driver SPI7 */
      </RTE_Components_h>
      <files>
        <file category="source" name="RTE_Driver/SPI_LPC5411x.c"/>
      </files>
    </component>

